In [1]:
import pandas as pd

In [37]:
classic_double_mhp = pd.read_csv('classic_double_mhp.csv')
print(len(classic_double_mhp))
classic_double_mhp.head()

12740

,room_name,refundable_rate,rate_id,stay_date,amount,breakfast,lunch,dinner,adultcount,childcount,infantcount,nights,ota_room_id,rate_update_id,refundable,rate_plan_code,date_update,availability,report_date
0,Classic Double,259.0,51867665159,2024-07-26,259.0,True,False,False,2,0,0,1,606651,34810000022877,True,NaN,2024-07-13 20:00:37,7,2024-07-13
1,Classic Double,199.0,51867665146,2024-07-26,199.0,False,False,False,2,0,0,1,606651,34810000022877,False,NaN,2024-07-13 20:00:37,7,2024-07-13
2,Classic Double,239.0,51867665160,2024-07-26,239.0,True,False,False,1,0,0,1,606651,34810000022877,True,NaN,2024-07-13 20:00:37,7,2024-07-13
3,Classic Double,239.0,51867665155,2024-07-26,239.0,True,False,False,2,0,0,1,606651,34810000022877,False,NaN,2024-07-13 20:00:37,7,2024-07-13
4,Classic Double,219.0,51867665156,2024-07-26,219.0,True,False,False,1,0,0,1,606651,34810000022877,False,NaN,2024-07-13 20:00:37,7,2024-07-13

In [38]:
classic_double_mhp = classic_double_mhp.sort_values(by='refundable_rate')
classic_double_mhp.head()

,room_name,refundable_rate,rate_id,stay_date,amount,breakfast,lunch,dinner,adultcount,childcount,infantcount,nights,ota_room_id,rate_update_id,refundable,rate_plan_code,date_update,availability,report_date
1159,Classic Double,149.0,51867672129,2025-02-09,149.0,False,False,False,2,0,0,1,606651,34810000022877,False,NaN,2024-07-13 01:00:31,7,2024-07-13
1118,Classic Double,149.0,51867671863,2025-02-02,149.0,False,False,False,2,0,0,1,606651,34810000022877,False,NaN,2024-07-13 01:00:31,7,2024-07-13
1243,Classic Double,159.0,51867672661,2025-02-23,159.0,False,False,False,2,0,0,1,606651,34810000022877,False,NaN,2024-07-13 01:00:31,7,2024-07-13
1029,Classic Double,159.0,51867671293,2025-01-18,159.0,False,False,False,2,0,0,1,606651,34810000022877,False,NaN,2024-07-13 01:00:31,7,2024-07-13
1081,Classic Double,159.0,51867671635,2025-01-27,159.0,False,False,False,2,0,0,1,606651,34810000022877,False,NaN,2024-07-13 01:00:31,7,2024-07-13

In [32]:
classic_double_mhp = classic_double_mhp[['room_name', 'refundable_rate', 'breakfast', 'lunch', 'dinner', 'adultcount', 'childcount', 'infantcount', 'refundable', 'report_date']]
classic_double_mhp.head()

,room_name,refundable_rate,breakfast,lunch,dinner,adultcount,childcount,infantcount,refundable,report_date
0,Classic Double,259.0,True,False,False,2,0,0,True,2024-07-13
1,Classic Double,199.0,False,False,False,2,0,0,False,2024-07-13
2,Classic Double,239.0,True,False,False,1,0,0,True,2024-07-13
3,Classic Double,239.0,True,False,False,2,0,0,False,2024-07-13
4,Classic Double,219.0,True,False,False,1,0,0,False,2024-07-13

In [33]:
classic_double_mhp.sort_values(by='refundable_rate')

,room_name,refundable_rate,breakfast,lunch,dinner,adultcount,childcount,infantcount,refundable,report_date
1159,Classic Double,149.0,False,False,False,2,0,0,False,2024-07-13
1118,Classic Double,149.0,False,False,False,2,0,0,False,2024-07-13
1243,Classic Double,159.0,False,False,False,2,0,0,False,2024-07-13
1029,Classic Double,159.0,False,False,False,2,0,0,False,2024-07-13
1081,Classic Double,159.0,False,False,False,2,0,0,False,2024-07-13
...,...,...,...,...,...,...,...,...,...,...
4326,Family Room,529.0,True,False,False,3,0,0,True,2024-07-13
4441,Family Room,529.0,True,False,False,3,0,0,True,2024-07-13
2012,Family Room,529.0,True,False,False,3,0,0,True,2024-07-13
10533,Suite with 1 King-Size Bed,529.0,True,False,False,2,0,0,True,2024-07-13
4389,Family Room,529.0,True,False,False,3,0,0,True,2024-07-13